In [1]:
#Importando a biblioteca pandas
import pandas as pd

In [3]:
#Cria um dataframe com os dados vindos do CSV
titanic = pd.read_csv('titanic.csv')
#Retorna as 5 primeiras linhas do Dataset
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
#Selecionando apenas a coluna nome do dataframe
titanic['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [22]:
#Selecionando a coluna ID e nome do dataframe
titanic[['PassengerId','Name']]

     PassengerId                                               Name
0              1                            Braund, Mr. Owen Harris
1              2  Cumings, Mrs. John Bradley (Florence Briggs Th...
2              3                             Heikkinen, Miss. Laina
3              4       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4              5                           Allen, Mr. William Henry
..           ...                                                ...
886          887                              Montvila, Rev. Juozas
887          888                       Graham, Miss. Margaret Edith
888          889           Johnston, Miss. Catherine Helen "Carrie"
889          890                              Behr, Mr. Karl Howell
890          891                                Dooley, Mr. Patrick

[891 rows x 2 columns]

In [24]:
#Contando a quantidade de passageiros de cada sexo
titanic['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [25]:
#Pesquisando nome e idade dos passageiros com 65 anos ou mais
titanic[['Name','Age']][titanic['Age'] >= 65]

                                     Name   Age
33                  Wheadon, Mr. Edward H  66.0
54         Ostby, Mr. Engelhart Cornelius  65.0
96              Goldschmidt, Mr. George B  71.0
116                  Connors, Mr. Patrick  70.5
280                      Duane, Mr. Frank  65.0
456             Millet, Mr. Francis Davis  65.0
493               Artagaveytia, Mr. Ramon  71.0
630  Barkworth, Mr. Algernon Henry Wilson  80.0
672           Mitchell, Mr. Henry Michael  70.0
745          Crosby, Capt. Edward Gifford  70.0
851                   Svensson, Mr. Johan  74.0

In [30]:
#Pesquisando nome e idade dos passageiros com 65 anos ou mais que sobreviveram
titanic[['Name','Age']][(titanic['Age'] >= 65) & (titanic['Survived'] == 1)]

                                     Name   Age
630  Barkworth, Mr. Algernon Henry Wilson  80.0

In [43]:
#MÃ©dia
titanic['Age'].mean()

29.69911764705882

In [47]:
#Mais novo
titanic['Age'].min()

0.42

In [45]:
#Mais velho
titanic['Age'].max()

80.0

In [49]:
#Substituindo Strings
titanic['Sex'].replace(['male','female'],['masculino','feminino'])

0      masculino
1       feminino
2       feminino
3       feminino
4      masculino
         ...
886    masculino
887     feminino
888     feminino
889    masculino
890    masculino
Name: Sex, Length: 891, dtype: object